# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Shahil Zhangada\OneDrive\Spring 2017\Mech Eng 135\KIT042_Accelerometer_LightPaint.cydsn\KIT042_Accelerometer_LightPaint.cyprj
# Date: Fri, 05 May 2017 01:15:46 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 8687.5 -waveform {0 4343.75} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_2(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_3(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {I2C_Accel_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 417 835} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list]
create_generated_clock -name {I2C_Accel_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Shahil Zhangada\OneDrive\Spring 2017\Mech Eng 135\KIT042_Accelerometer_LightPaint.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Shahil Zhangada\OneDrive\Spring 2017\Mech Eng 135\KIT042_Accelerometer_LightPaint.cydsn\KIT042_Accelerometer_LightPaint.cyprj
# Date: Fri, 05 May 2017 01:15:42 GMT
